tap "artginzburg/tap"
tap "domt4/autoupdate"
tap "homebrew/cask"
tap "homebrew/core"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Command-line tool for DigitalOcean
brew "doctl"
# OpenType text shaping engine
brew "harfbuzz"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk@21"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Python interface to Tcl/Tk
brew "python-tk@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Multi-media library with bindings for multiple languages
brew "sfml"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool Command Language
brew "tcl-tk"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Hide unwanted icons from your menu bar
brew "artginzburg/tap/barhide"
# Permanent TouchID support for sudo
brew "artginzburg/tap/sudo-touchid"
# Copy, QR encode or just get the password of current Wi-Fi connection
brew "artginzburg/tap/wifi-pass"
# Application uninstaller
cask "appcleaner"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Write, edit, and chat about your code with AI
cask "cursor"
# Toggle the macOS dark mode from Spotlight Search
cask "darkmode"
# Game engine for development of desktop, mobile and web games
cask "defold"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Download manager with a torrent client
cask "folx"
# Quickly toggle the `fn` key behavior on macOS
cask "functiontoggler"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Tool to optimise images to a smaller size
cask "imageoptim"
# End-to-end encryption software
cask "keybase"
# Custom Discord client
cask "legcord"
# Clipboard manager
cask "maccy"
# Add middle click for Trackpad and Magic Mouse
cask "middle"
# Utility to extend trackpad functionality
cask "middleclick"
# Sandbox construction video game
cask "minecraft"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Alternate version of the Opera web browser to complement gaming
cask "opera-gx"
# WebKit based web browser
cask "orion"
# Open app store
cask "overt"
# Desktop virtualization software
cask "parallels"
# Brings Picture in Picture shortcut and custom button to any video
cask "piposs"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Mesh VPN based on WireGuard
cask "tailscale"
# Messaging app with a focus on speed and security
cask "telegram"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
mas "1-Click Video Converter", id: 717545086
mas "AdBlock", id: 1402042596
mas "Adblock for Youtube™", id: 1592568016
mas "Adblock Plus", id: 1432731683
mas "Bitwarden", id: 1352778147
mas "Color Picker", id: 1545870783
mas "Dato", id: 1470584107
mas "Day Progress", id: 6450280202
mas "Dynamic Lyrics", id: 6476125287
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Lungo", id: 1263070803
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Outline", id: 1356178125
mas "OverPicture", id: 1188020834
mas "Pages", id: 409201541
mas "Shazam", id: 897118787
mas "Spark", id: 1176895641
mas "Spark Desktop", id: 6445813049
mas "Subtitly", id: 6673901809
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Transporter", id: 1450874784
mas "Userscripts", id: 1463298887
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "ahmadalli.vscode-nginx-conf"
vscode "amodio.tsl-problem-matcher"
vscode "apvarun.celestial"
vscode "astro-build.astro-vscode"
vscode "bengreenier.vscode-node-readme"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-preview-github-styles"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "cesium.gltf-vscode"
vscode "chakrounanas.turbo-console-log"
vscode "chunsen.bracket-select"
vscode "cssho.vscode-svgviewer"
vscode "danielhuth.styco"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "devhippo.midnight-crimson"
vscode "docker.docker"
vscode "dprint.dprint"
vscode "drmerfy.overtype"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "enenumxela.signed-dark-pro"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "fivethree.vscode-ionic-snippets"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "genuitecllc.codetogether"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "idleberg.applescript"
vscode "ionic.ionic"
vscode "kangping.protobuf"
vscode "katjanakosic.vscode-json5"
vscode "kisstkondoros.typelens"
vscode "kisstkondoros.vscode-codemetrics"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "liximomo.remotefs"
vscode "lokalise.i18n-ally"
vscode "maxvanderschee.web-accessibility"
vscode "mikerhyssmith.ts-barrelr"
vscode "minecraftcommands.syntax-mcfunction"
vscode "mintlify.document"
vscode "mrmlnc.vscode-apache"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "myxvisual.vscode-ts-uml"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pfg.vscode-shortcutslang-extension"
vscode "ph1p.zeit-co-vscode-schemas"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "react-labyrinth.react-labyrinth"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "shakram02.bash-beautify"
vscode "sirmspencer.vscode-autohide"
vscode "sleistner.vscode-fileutils"
vscode "socheatsok78-lab.dotenv-vscode-stripped"
vscode "stevencl.adddoccomments"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-russian"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "tal7aouy.icons"
vscode "timonwong.shellcheck"
vscode "tootone.org-mode"
vscode "truman.autocomplate-shell"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "unional.vscode-sort-package-json"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wakatime.vscode-wakatime"
vscode "wallabyjs.console-ninja"
vscode "withfig.fig"
vscode "wmaurer.change-case"
vscode "wraith13.open-in-github-desktop"
vscode "yoavbls.pretty-ts-errors"
vscode "yy0931.save-as-root"
vscode "zignd.html-css-class-completion"
vscode "znck.grammarly"
vscode "zxh404.vscode-proto3"
